Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ОтладочнаяОбработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>iga_ОтладочнаяОбработка</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПоследниеСообщенияЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПоследниеСообщенияЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ИсторияСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ИсторияСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрочитаноОператором</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЦитирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЦитирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяМетка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDЦитируемогоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПрикрепленныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПрикрепленныеФайлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипМедиа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыМедиаФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОбработкиФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URLЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КартинкаФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ОчередьРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ОчередьРаспределения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонцаБронирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПродлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнимПисалОператор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсобыйЧат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ИсторияОтказовЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ИсторияОтказовЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ПричиныОтклоненияОжидающихЧатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПричины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ОповещенияПоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ОповещенияПоВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/омг_НастройкиИнтеграцииСЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>омг_НастройкиИнтеграцииСЛИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПозицииИсключенияИзОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПозицииИсключенияИзОповещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_СтатусыПодтвержденияСтрокЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_СтатусыПодтвержденияСтрокЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ОтладочнаяОбработка/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьПоследниеСообщенияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ЧатыБезПоследнихВходящих
	               |ИЗ
	               |	Справочник.iga_Чаты КАК iga_Чаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПоследниеСообщенияЧатов КАК iga_ПоследниеСообщенияЧатов
	               |		ПО (iga_ПоследниеСообщенияЧатов.Чат = iga_Чаты.Ссылка
	               |				И iga_ПоследниеСообщенияЧатов.ЭтоВходящее)
	               |ГДЕ
	               |	iga_ПоследниеСообщенияЧатов.Чат ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	iga_ИсторияСообщений.Чат КАК Чат,
	               |	МАКСИМУМ(iga_ИсторияСообщений.ДатаСообщения) КАК ДатаСообщения
	               |ИЗ
	               |	ВТ_ЧатыБезПоследнихВходящих КАК ВТ_ЧатыБезПоследнихВходящих
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
	               |		ПО ВТ_ЧатыБезПоследнихВходящих.Ссылка = iga_ИсторияСообщений.Чат
	               |ГДЕ
	               |	iga_ИсторияСообщений.ЭтоВходящее
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	iga_ИсторияСообщений.Чат";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.iga_ПоследниеСообщенияЧатов.СоздатьМенеджерЗаписи();
		Запись.Чат = Выборка.Чат;
		Запись.ДатаСообщения = Выборка.ДатаСообщения;
		Запись.ЭтоВходящее = Истина;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоследниеСообщения(Команда)
	ЗаполнитьПоследниеСообщенияНаСервере();
	ПоказатьПредупреждение(, "ОК");
КонецПроцедуры

&НаСервере
Функция ВыполнитьПервичнуюЗагрузкуФайла(Бот, ИдЧата, ИдСообщения) Экспорт
	
	Менеджер = РегистрыСведений.iga_ПрикрепленныеФайлы.СоздатьМенеджерЗаписи();
	Менеджер.IDСообщения = ИдСообщения;
	Менеджер.Прочитать();
	
	ВоспроизведениеКонтентаВнутри = Константы.iga_ВоспроизведениеКонтентаВнутри.Получить();
	
	СтатусОжидает = ПредопределенноеЗначение("Перечисление.iga_СтатусыОбработкиФайлов.Ожидает");
	СтатусОшибка  = ПредопределенноеЗначение("Перечисление.iga_СтатусыОбработкиФайлов.Ошибка");
	
	ПерезагрузитьДанные = Ложь;
	
	Если (СтрНайти(Менеджер.ИмяФайла, ".oga") > 0
		Или СтрНайти(Менеджер.ИмяФайла, ".ogg") > 0) 
		И ВоспроизведениеКонтентаВнутри Тогда
		ПерезагрузитьДанные = Истина;
		Менеджер.Статус = СтатусОжидает;
	КонецЕсли;
	
	Если Не Менеджер.Выбран() И Не ПерезагрузитьДанные Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Менеджер.Статус <> СтатусОжидает И Менеджер.Статус <> СтатусОшибка Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		РезультатAPI = Бот.СкачатьФайлИзСообщения(ИдЧата, ИдСообщения);
	Исключение
		РезультатAPI = Новый Структура("downloadUrl", Менеджер.URLЗагрузки);
	КонецПопытки;
	
	Если ТипЗнч(РезультатAPI) <> Тип("Структура") ИЛИ Не РезультатAPI.Свойство("downloadUrl") Тогда
		Менеджер.Статус = СтатусОшибка;
		Менеджер.ТекстОшибки = "Сервис не вернул ссылку на скачивание (downloadUrl)";
		Менеджер.Записать();
		Возврат Ложь;
	КонецЕсли;
	
	
	
	Попытка
		ДвоичныеДанные = Новый ДвоичныеДанные(Бот.СкачатьФайлПоСсылке(РезультатAPI.downloadUrl));
		
		Расширение = НРег(Сред(Менеджер.ИмяФайла, СтрНайти(Менеджер.ИмяФайла, ".", НаправлениеПоиска.СКонца) + 1));
		
		Если ВоспроизведениеКонтентаВнутри И (Расширение = "oga" ИЛИ Расширение = "ogg") Тогда
			
			ДанныеMp3 = КонвертироватьOgaВMp3(ДвоичныеДанные);
			
			Если ДанныеMp3 <> Неопределено Тогда
				ДвоичныеДанные = ДанныеMp3;
				Менеджер.ИмяФайла = СтрЗаменить(НРег(Менеджер.ИмяФайла), "." + Расширение, ".mp3");
			КонецЕсли;
			
		КонецЕсли;
		
		Менеджер.ДанныеФайла = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		Менеджер.Статус      = ПредопределенноеЗначение("Перечисление.iga_СтатусыОбработкиФайлов.Загружен");
		Менеджер.ТекстОшибки = "";
		Менеджер.Записать();
		
		Возврат Истина;
		
	Исключение
		Менеджер.Статус = СтатусОшибка;
		Менеджер.ТекстОшибки = "Ошибка при загрузке тела файла: " + ОписаниеОшибки();
		Менеджер.Записать();
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПолучитьПутьКFfmpeg() Экспорт
	
	ПутьККаталогу = КаталогВременныхФайлов() + "1c_ffmpeg\";
	СоздатьКаталог(ПутьККаталогу);
	
	ПутьКФайлу = ПутьККаталогу + "ffmpeg.exe";
	
	ФайлНаДиске = Новый Файл(ПутьКФайлу);
	
	Если Не ФайлНаДиске.Существует() Тогда
		Попытка
			Макет = ПолучитьОбщийМакет("ffmpeg_exe");
			Макет.Записать(ПутьКФайлу);
		Исключение
			ЗаписьЖурналаРегистрации("WhatsApp.Медиа", УровеньЖурналаРегистрации.Ошибка, , , 
				"Не удалось извлечь ffmpeg.exe: " + ОписаниеОшибки());
			Возврат "";
		КонецПопытки;
	КонецЕсли;
	
	Возврат ПутьКФайлу;
	
КонецФункции

&НаСервере
Функция КонвертироватьOgaВMp3(ДанныеOga) Экспорт
	
	ПутьКFfmpeg = ПолучитьПутьКFfmpeg();
	Если ПустаяСтрока(ПутьКFfmpeg) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяВходящего = ПолучитьИмяВременногоФайла("oga");
	ИмяИсходящего = ПолучитьИмяВременногоФайла("mp3");
	
	ДанныеOga.Записать(ИмяВходящего);
	
	СтрокаЗапуска = """" + ПутьКFfmpeg + """ -i """ + ИмяВходящего + """ -y """ + ИмяИсходящего + """";
	
	Попытка
		ЗапуститьПриложение(СтрокаЗапуска, , Истина);
		
		ФайлРезультат = Новый Файл(ИмяИсходящего);
		Если ФайлРезультат.Существует() И ФайлРезультат.Размер() > 0 Тогда
			ДанныеMp3 = Новый ДвоичныеДанные(ИмяИсходящего);
		Иначе
			ДанныеMp3 = Неопределено;
		КонецЕсли;
	Исключение
		ДанныеMp3 = Неопределено;
		ЗаписьЖурналаРегистрации("WhatsApp.Медиа", УровеньЖурналаРегистрации.Ошибка, , , 
			"Ошибка при запуске конвертации: " + ОписаниеОшибки());
	КонецПопытки;
	
	УдалитьФайлы(ИмяВходящего);
	УдалитьФайлы(ИмяИсходящего);
	
	Возврат ДанныеMp3;
	
КонецФункции


&НаСервере
Процедура ПроверитьИПерезагрузитьОгаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ИсторияСообщений.Чат.Идентификатор КАК ЧатИдентификатор,
	               |	iga_ИсторияСообщений.IDСообщения КАК IDСообщения
	               |ИЗ
	               |	РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПрикрепленныеФайлы КАК iga_ПрикрепленныеФайлы
	               |		ПО iga_ИсторияСообщений.IDСообщения = iga_ПрикрепленныеФайлы.IDСообщения
	               |ГДЕ
	               |	iga_ИсторияСообщений.ДатаСообщения МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И iga_ИсторияСообщений.ЕстьФайл
	               |	И (iga_ПрикрепленныеФайлы.ПутьКФайлу ПОДОБНО ""%"" + "".oga""
	               |			ИЛИ iga_ПрикрепленныеФайлы.ПутьКФайлу ПОДОБНО ""%"" + "".ogg"")";
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	Пока Выборка.Следующий() Цикл
		ВыполнитьПервичнуюЗагрузкуФайла(Бот, Выборка.ЧатИдентификатор, Выборка.IDСообщения);
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обработано " + Выборка.Количество();
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИПерезагрузитьОга(Команда)
	ПроверитьИПерезагрузитьОгаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыОбщенияБотаНаСервере()
	

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыОбщенияБота(Команда)
	ЗаполнитьПараметрыОбщенияБотаНаСервере();
	ПоказатьПредупреждение(, "ОК");
КонецПроцедуры

&НаСервере
Процедура СброситьЧатыОператораНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Оператор = &Оператор
	               |	И НЕ iga_ОчередьРаспределения.Статус = &СтатусЗавершен";
	Запрос.УстановитьПараметр("СтатусЗавершен", Перечисления.iga_СтатусыОчереди.Завершен);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		Запись.Чат = Выборка.Чат;
		Запись.Оператор = Оператор;
		Запись.Прочитать();
		Запись.Статус = Перечисления.iga_СтатусыОчереди.Завершен;
		Запись.Записать();
		
		Запись = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		Запись.Чат = Выборка.Чат;
		Запись.БезОповещения = Истина;
		Запись.ДатаПоступления = НачалоДня(ТекущаяДата());
		Запись.ДатаПоследнейАктивности = ТекущаяДата();
		Запись.Статус = Перечисления.iga_СтатусыОчереди.Ожидание;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьЧатыОператора(Команда)
	СброситьЧатыОператораНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсправитьИдентификаторыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.iga_Чаты КАК iga_Чаты
	               |ГДЕ
	               |	iga_Чаты.Идентификатор ПОДОБНО ""%"" + ""@с.us""";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЧатОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЧатОбъект.Идентификатор = СтрЗаменить(ЧатОбъект.Идентификатор, "@с.us", "@c.us");
		ЧатОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьИдентификаторы(Команда)
	ИсправитьИдентификаторыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПереносВидаШаблонаНаСервере()
	Шаблон1 = ПервыйШаблон.ПолучитьОбъект();
	Шаблон2 = ВторойШаблон.ПолучитьОбъект();
	Шаблон2.ВидПредопределенногоШаблона = Шаблон1.ВидПредопределенногоШаблона;
	Шаблон1.ВидПредопределенногоШаблона = "";
	Шаблон1.Записать();
	Шаблон2.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПереносВидаШаблона(Команда)
	ПереносВидаШаблонаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьИсториюОтказовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
	               |	iga_ИсторияОтказовЧатов.Чат КАК Чат,
	               |	iga_ИсторияОтказовЧатов.Оператор КАК Оператор,
	               |	iga_ИсторияОтказовЧатов.Дата КАК Дата
	               |ИЗ
	               |	РегистрСведений.iga_ИсторияОтказовЧатов КАК iga_ИсторияОтказовЧатов
	               |ГДЕ
	               |	iga_ИсторияОтказовЧатов.Дата <= &Дата";
	Запрос.УстановитьПараметр("Дата", ДатаОчистки);
	
	Пока Истина Цикл
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() ТОгда
			Прервать;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.iga_ИсторияОтказовЧатов.СоздатьМенеджерЗаписи();
			Запись.Чат = Выборка.Чат;
			Запись.Оператор = Выборка.Оператор;
			Запись.Дата = Выборка.Дата;
			Запись.Удалить();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсториюОтказов(Команда)
	ОчиститьИсториюОтказовНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьИзОжиданияСтарыеЧатыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Оператор КАК Оператор
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПоследниеСообщенияЧатов КАК iga_ПоследниеСообщенияЧатов
	               |		ПО (РАЗНОСТЬДАТ(iga_ПоследниеСообщенияЧатов.ДатаСообщения, &ТекущаяДата, ЧАС) > 24)
	               |			И (iga_ПоследниеСообщенияЧатов.ЭтоВходящее)
	               |			И iga_ОчередьРаспределения.Чат = iga_ПоследниеСообщенияЧатов.Чат
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Статус = &Статус";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Статус", Перечисления.iga_СтатусыОчереди.Ожидание);
	Выборка = Запрос.Выполнить().Выбрать();
	ПОка Выборка.Следующий() Цикл
		Запись = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		Запись.Чат = Выборка.Чат;
		Запись.Оператор = Выборка.Оператор;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Статус = Перечисления.iga_СтатусыОчереди.Завершен;
			Запись.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзОжиданияСтарыеЧаты(Команда)
	УдалитьИзОжиданияСтарыеЧатыНаСервере();
	ПоказатьПредупреждение(, "Готово");
КонецПроцедуры

&НаСервере
Процедура СоздатьОповещенияОЗаписиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	iga_ОповещенияПоВремени.Заявка КАК Заявка,
	               |	КОЛИЧЕСТВО(iga_ОповещенияПоВремени.Заявка) КАК КоличествоОповещений,
	               |	iga_ОповещенияПоВремени.Чат КАК Чат,
	               |	МАКСИМУМ(iga_ОповещенияПоВремени.ДатаОповещения) КАК ДатаОповещения
	               |ИЗ
	               |	РегистрСведений.iga_ОповещенияПоВремени КАК iga_ОповещенияПоВремени
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ОповещенияПоВремени КАК iga_ОповещенияПоВремени1
	               |		ПО iga_ОповещенияПоВремени.Заявка = iga_ОповещенияПоВремени1.Заявка
	               |			И (iga_ОповещенияПоВремени1.ТребуетсяПодтверждение)
	               |ГДЕ
	               |	iga_ОповещенияПоВремени.ДатаЗаписи > &ТекущаяДата
	               |	И (iga_ОповещенияПоВремени.Заявка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |			ИЛИ &Заявка = iga_ОповещенияПоВремени.Заявка)
	               |	И iga_ОповещенияПоВремени1.Заявка ЕСТЬ NULL
	               |	И iga_ОповещенияПоВремени.Выполнено
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	iga_ОповещенияПоВремени.Заявка,
	               |	iga_ОповещенияПоВремени.Чат";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьОповещенияПоВремени = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьМенеджерЗаписи();
		ЗаписьОповещенияПоВремени.Заявка = Выборка.Заявка;
		ЗаписьОповещенияПоВремени.ДатаОповещения = Выборка.ДатаОповещения;
		ЗаписьОповещенияПоВремени.Прочитать();
		
		ЗафиксироватьНапоминанияВРегистре(Выборка.Заявка, Выборка.Чат);
		ЗаписьОповещенияПоВремени.Записать(Ложь);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОповещенияОЗаписи(Команда)
	СоздатьОповещенияОЗаписиНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиЧатПоСообщениямНаСервере(Знач СтрокаПоиска)
	
	// 1. Очищаем строку от спецсимволов и знаков препинания, которые ломают ПТП
	СимволыДляУдаления = "()[]{}\/|<>,.:;?!+-=""'*~_";
	Для Индекс = 1 По СтрДлина(СимволыДляУдаления) Цикл
		СтрокаПоиска = СтрЗаменить(СтрокаПоиска, Сред(СимволыДляУдаления, Индекс, 1), " ");
	КонецЦикла;
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// 2. Разбиваем на массив, удаляя двойные пробелы
	МассивСлов = СтрРазделить(СтрокаПоиска, " ", Ложь);
	
	МаксимумСловДляПоиска = 7;
	Пока МассивСлов.Количество() > МаксимумСловДляПоиска Цикл
		МассивСлов.Удалить(МассивСлов.ВГраница());
	КонецЦикла;
	
	// 3. Формируем чистую строку для первого (точного) поиска
	СтрокаПоискаОчищенная = СтрСоединить(МассивСлов, " ");
	
	Попытка
		СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоискаОчищенная, 100);
		СписокПоиска.ОбластьПоиска.Добавить(Метаданные.РегистрыСведений.iga_ИсторияСообщений);
		СписокПоиска.ПерваяЧасть();
		
		// 4. Если точный поиск ничего не дал, ищем по маске (со звездочками)
		Если СписокПоиска.Количество() = 0 Тогда
			МассивСловСМаской = Новый Массив;
			
			Для Каждого Слово Из МассивСлов Цикл
				// ЗВЕЗДОЧКУ СТАВИМ ТОЛЬКО НА ДЛИННЫЕ СЛОВА (> 2 символов)!
				// Короткие слова вроде "в", "к", "с", "2", "4" оставляем как есть
				Если СтрДлина(Слово) > 2 Тогда
					МассивСловСМаской.Добавить(Слово + "*");
				Иначе
					МассивСловСМаской.Добавить(Слово);
				КонецЕсли;
			КонецЦикла;
			
			СтрокаПоискаСЗвездочкой = СтрСоединить(МассивСловСМаской, " ");
			
			СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоискаСЗвездочкой, 100);
			СписокПоиска.ОбластьПоиска.Добавить(Метаданные.РегистрыСведений.iga_ИсторияСообщений);
			СписокПоиска.ПерваяЧасть();
		КонецЕсли;
		
		Для Каждого Результат Из СписокПоиска Цикл
			Возврат Результат.Значение.Чат;
		КонецЦикла;
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Асинх Процедура ПоискПоПТП(Команда)
	
	СтрокаПоиска = Ждать ВвестиСтрокуАсинх(, "Введите слово для поиска", 100);
	
	Если Не ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	Чат = НайтиЧатПоСообщениямНаСервере(СтрокаПоиска);
	
	Если Не Чат = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Чат найден";
		Сообщение.Сообщить();
	Иначе 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Чат не найден";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРаботуПТП(Команда)
	ПроверитьРаботуПТПНаСервере("йцу1й2цу");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьРаботуПТПНаСервере(Знач СтрокаПоиска)
	
	Сообщить("--- Начинаем тест ПТП по строке: """ + СтрокаПоиска + """ ---");
	
	Попытка
		// Ищем "как есть", без очистки, звездочек и разбивки на массивы
		СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска, 20);
		
		// Ограничиваем область поиска нашим регистром
		СписокПоиска.ОбластьПоиска.Добавить(Метаданные.РегистрыСведений.iga_ИсторияСообщений);
		
		// Выполняем поиск
		СписокПоиска.ПерваяЧасть();
		
		Если СписокПоиска.Количество() = 0 Тогда
			Сообщить("❌ ПТП отработал без ошибок, но ничего не нашел.");
			Сообщить("Вывод: Текста физически нет в индексе платформы.");
		Иначе
			Сообщить("✅ Успех! Найдено записей: " + СписокПоиска.Количество());
			
			// Выводим результаты для наглядности
			Для Каждого Результат Из СписокПоиска Цикл
				// Замените .Чат на имя вашего измерения/реквизита, если оно отличается
				Сообщить(" -> Чат: " + Строка(Результат.Значение.Чат)); 
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		Сообщить(" Ошибка при выполнении ПТП: " + ОписаниеОшибки());
	КонецПопытки;
	
	Сообщить("--- Тест завершен ---");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОповещениеПоВремени(НаборЗаписей, ЗанятыеДаты, ЧатСсылка, Заявка, ДатаНачала, ТекущаяДата) Экспорт
	
		ДатаДокумента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заявка, "Дата");
		
		КоличествоЧасов = iga_ОбщегоНазначенияКлиентСервер.РазностьДат(ТекущаяДата, ДатаНачала, "ЧАС");
				
		Более24 = Ложь;
		Более12 = Ложь;
		Более3 = Ложь;
		МинусЧасов = 0;
		
		Если КоличествоЧасов > 3 Тогда
			Более3 = Истина
		КонецЕсли;
		Если КоличествоЧасов > 12 Тогда
			МинусЧасов = -12;
			Более12 = Истина;
		КонецЕсли;

		//Если КоличествоЧасов > 24 Тогда
		//	МинусЧасов = -24;
		//	Более24 = Истина;
		//КонецЕсли;
		
		
		Если (Более24 Или Более12) 
			И ?(День(ДатаДокумента) + 1 = День(ДатаНачала), Час(ДатаДокумента) < 17, Истина) Тогда

			ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ДатаНачала, "ЧАС", МинусЧасов);
			
			Если Час(ДатаОповещения) >= 0 И Час(ДатаОповещения) < 7 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(НачалоДня(ДатаОповещения)-1), "ЧАС", 17);
			ИначеЕсли Час(ДатаОповещения) > 17 И Час(ДатаОповещения) <= 23 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(ДатаОповещения), "ЧАС", 17);
			КонецЕсли;       
			
			Если ЗанятыеДаты.Найти(ДатаОповещения) = Неопределено Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Заявка = Заявка;
				Запись.ДатаОповещения = ДатаОповещения;
				Запись.ТребуетсяПодтверждение = Истина;
				Запись.ДатаЗаписи = ДатаНачала;
				Запись.Чат = ЧатСсылка; 
				ЗанятыеДаты.Добавить(ДатаОповещения);
				Запись.ШаблонОповещения = Справочники.iga_ШаблоныСообщений.Предопределенный(Перечисления.iga_ВидыПредопределенныхШаблонов.ПодтверждениеЗаписи);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Более3 Тогда

			ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ДатаНачала, "ЧАС", -3);

			Если Час(ДатаОповещения) >= 0 И Час(ДатаОповещения) < 6 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(ДатаОповещения), "ЧАС", 6);
			ИначеЕсли Час(ДатаОповещения) > 20 И Час(ДатаОповещения) <=23 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(ДатаОповещения), "ЧАС", 20);
			КонецЕсли;
			
			Если ЗанятыеДаты.Найти(ДатаОповещения) = Неопределено Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Заявка = Заявка;
				Запись.ДатаОповещения = ДатаОповещения;
				Запись.ДатаЗаписи = ДатаНачала;
				Запись.Чат = ЧатСсылка;
				ЗанятыеДаты.Добавить(ДатаОповещения);
				Запись.ШаблонОповещения = Справочники.iga_ШаблоныСообщений.Предопределенный(Перечисления.iga_ВидыПредопределенныхШаблонов.ОповещениеОЗаписи);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецПроцедуры
	
&НаСервереБезКонтекста
Процедура ЗафиксироватьНапоминанияВРегистре(Заявка, ЧатСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ПропускаемыеПозиции
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	iga_ПозицииИсключенияИзОповещений.Номенклатура
	               |ИЗ
	               |	РегистрСведений.iga_ПозицииИсключенияИзОповещений КАК iga_ПозицииИсключенияИзОповещений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.Ссылка КАК Ссылка,
	               |	ЗаявкаРаботы.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ЗаявкаРаботы.Номенклатура.Наименование, ""Прием"") КАК НоменклатураНаименование,
	               |	ВЫБОР
	               |		КОГДА ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |			ТОГДА ЗаявкаРаботы.ДатаНачала
	               |		ИНАЧЕ ЗаявкаРаботы.Ссылка.ДатаНачала
	               |	КОНЕЦ КАК ДатаНачала,
	               |	ЕСТЬNULL(ЗаявкаРаботы.Сотрудник.Ссылка, ЗаявкаРаботы.Ссылка.Сотрудник) КАК Сотрудник
	               |ПОМЕСТИТЬ ВТ_ВсеБудущиеЗаписи
	               |ИЗ
	               |	Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |ГДЕ
	               |	(НЕ ЗаявкаРаботы.Ссылка.омг_БезЗаписи
	               |				И НЕ ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |			ИЛИ НЕ ЗаявкаРаботы.омг_БезЗаписиНесколькоВрачей
	               |				И ЗаявкаРаботы.Ссылка.НесколькоСотрудников)
	               |	И ЗаявкаРаботы.Ссылка.ДатаНачала >= &Дата
	               |	И НЕ ЗаявкаРаботы.Номенклатура В ИЕРАРХИИ
	               |				(ВЫБРАТЬ
	               |					ВТ_ПропускаемыеПозиции.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |				ИЗ
	               |					ВТ_ПропускаемыеПозиции КАК ВТ_ПропускаемыеПозиции)
	               |	И ЗаявкаРаботы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	ВложенныйЗапрос.ДатаНачала КАК ДатаНачала,
	               |	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ВсеБудущиеЗаписи.Ссылка КАК Ссылка,
	               |		МИНИМУМ(ВТ_ВсеБудущиеЗаписи.ДатаНачала) КАК ДатаНачала,
	               |		ВТ_ВсеБудущиеЗаписи.Сотрудник КАК Сотрудник,
	               |		ВТ_ВсеБудущиеЗаписи.Номенклатура КАК Номенклатура
	               |	ИЗ
	               |		ВТ_ВсеБудущиеЗаписи КАК ВТ_ВсеБудущиеЗаписи
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВТ_ВсеБудущиеЗаписи.Ссылка КАК Ссылка,
	               |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеБудущиеЗаписи.Номенклатура) КАК КоличествоСтрок
	               |			ИЗ
	               |				ВТ_ВсеБудущиеЗаписи КАК ВТ_ВсеБудущиеЗаписи
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВТ_ВсеБудущиеЗаписи.Ссылка) КАК ВложенныйЗапрос
	               |			ПО ВТ_ВсеБудущиеЗаписи.Ссылка = ВложенныйЗапрос.Ссылка
	               |	ГДЕ
	               |		(ВТ_ВсеБудущиеЗаписи.Номенклатура.Ссылка ЕСТЬ NULL
	               |					И ВложенныйЗапрос.КоличествоСтрок = 1
	               |				ИЛИ НЕ ВТ_ВсеБудущиеЗаписи.Номенклатура.Ссылка ЕСТЬ NULL
	               |					И ВложенныйЗапрос.КоличествоСтрок >= 1)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ВсеБудущиеЗаписи.Сотрудник,
	               |		ВТ_ВсеБудущиеЗаписи.Ссылка,
	               |		ВТ_ВсеБудущиеЗаписи.Номенклатура) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала
	               |ИТОГИ
	               |	МАКСИМУМ(Ссылка),
	               |	МАКСИМУМ(Сотрудник)
	               |ПО
	               |	ДатаНачала";
	ТекущаяДата = ТекущаяДата();
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата);
	ВыборкаДат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НаборЗаписей = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	ЗаписиРабот = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьНаборЗаписей();
	ЗаписиРабот.Отбор.Заявка.Установить(Заявка);
	ЗанятыеДаты = Новый Массив;
	
	
	Пока ВыборкаДат.Следующий() Цикл
		
		ДатаНачала = ВыборкаДат.ДатаНачала;
		
		ЗаписатьОповещениеПоВремени(НаборЗаписей, ЗанятыеДаты, ЧатСсылка, Заявка, ДатаНачала, ТекущаяДата);
		
		iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ЧатСсылка, "ОтправленоОповещение", Истина);
		
		ВыборкаРаботы = ВыборкаДат.Выбрать();
		
		ТребуетсяПодтверждение = Ложь;
		
		Для Каждого ЗаписьОповещения Из НаборЗаписей Цикл
			Если ЗаписьОповещения.ТребуетсяПодтверждение Тогда
				ТребуетсяПодтверждение = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ТребуетсяПодтверждение  Тогда
			Пока ВыборкаРаботы.Следующий() Цикл
				Запись = ЗаписиРабот.Добавить();
				Запись.Заявка = Заявка;
				Запись.Работа = ВыборкаРаботы.Номенклатура;
				Запись.ДатаЗаписи = ДатаНачала;
			КонецЦикла;
		КонецЕсли;
		
		
	КонецЦикла;
	
	ЗаписиРабот.Записать();
	НаборЗаписей.Записать();
	
КонецПроцедуры


&НаСервере
Процедура ТестСозданияОповещенийНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                  |	iga_ИсторияСообщений.Чат КАК Чат,
	                  |	ЗаявкаДок.Ссылка КАК Ссылка,
	                  |	ЗаявкаДок.ДатаНачала КАК ДатаНачала
	                  |ИЗ
	                  |	РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ОповещенияПоВремени КАК iga_ОповещенияПоВремени
	                  |		ПО iga_ИсторияСообщений.Чат = iga_ОповещенияПоВремени.Чат
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
	                  |		ПО iga_ИсторияСообщений.Чат = iga_ЧатыКлиентов.Чат
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК ЗаявкаДок
	                  |		ПО (НАЧАЛОПЕРИОДА(iga_ИсторияСообщений.ДатаСообщения, ДЕНЬ) = НАЧАЛОПЕРИОДА(ЗаявкаДок.Дата, ДЕНЬ))
	                  |			И (ЗаявкаДок.Клиент = iga_ЧатыКлиентов.Клиент)
	                  |ГДЕ
	                  |	iga_ИсторияСообщений.ДатаСообщения МЕЖДУ &ДатаНачала И &ДатаОкончания
	                  |	И iga_ИсторияСообщений.Текст ПОДОБНО ""%"" + ""Вы успешно записаны"" + ""%""
	                  |	И iga_ОповещенияПоВремени.Заявка ЕСТЬ NULL
	                  |	И ЗаявкаДок.ДатаНачала >= &ТекущаяДата
	                  |	И ВЫБОР
	                  |			КОГДА &Заявка = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
	                  |				ТОГДА ИСТИНА
	                  |			ИНАЧЕ ЗаявкаДок.Ссылка = &Заявка
	                  |		КОНЕЦ";
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()) + 1);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗафиксироватьНапоминанияВРегистре(Выборка.Ссылка, Выборка.Чат);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТестСозданияОповещений(Команда)
	ТестСозданияОповещенийНаСервере();
КонецПроцедуры
